{

    "roleDescription": "Responsible for managing the sales team, defining KPIs, analyzing market trends, and developing strategies to boost sales. The Head of Sales makes data-driven decisions to optimize commercial performance and manage external partnerships.",
    "responsibilities": [
      "Forecast monthly, quarterly, and annual sales results",
      "Approve or reject budgets and conduct risk management",
      "Evaluate and decide on investments",
      "Supervise sales teams and allocate resources efficiently",
      "Conduct profit and cost analyses",
      "Develop secure procedures to maintain confidential information",
      "Ensure all sales activities comply with financial regulations",
      "Consult board members about funding options and recommend cost-reducing solutions"
    ],
    "qualifications": [
      "Bachelor's degree in Business Management, Communications, Marketing, or Sales",
      "Master's degree or PhD in a related field is preferred",
      "Extensive work experience in sales or marketing positions"
    ],
    "skills": [
      "Analytical skills for data-driven decision making",
      "Proficiency in Microsoft Office and computing skills for performance analysis",
      "Interpersonal skills for building trust and encouraging openness",
      "Leadership skills for supervising and motivating the sales department"
    ],
    "additionalRoleInformation": {
      "DirectorOfSalesDuties": [
        "Developing strategic plans to achieve sales targets",
        "Leading sales teams to develop customer relations and increase market share",
        "Creating training programmes for sales department employees",
        "Understanding market trends to adjust selling prices and sales objectives"
      ],
      "ExperienceRequirements": "7 to 10 years of experience in a senior sales role, with a history of achieving sales quotas and leading sales teams.",
      "EducationAndTrainingRequirements": "Bachelor’s degree in relevant fields, higher national diploma equivalent, or Sales Executive higher apprenticeship. Professional qualifications from the Institute of Sales Management are desirable."
    }
  }

